Repository: retrofor/IamAI
Catalog: iamai/locale/*/LC_MESSAGES/i18n.po
Languages: de

source: Running iamai...
de: iamai läuft...

source: Startup adapter {_adapter!r} failed: {error}
de: Startadapter {_adapter!r} fehlgeschlagen: {error}

source: Succeeded to remove plugin "{plugin_.__name__}" from file "{file}"
de: Plugin "{plugin_.__name__}" erfolgreich aus File "{file}" entfernt

source: Hot reload needs to install "watchfiles", try "pip install watchfiles"
de: Für Hot Reload muss "watchfiles" installiert werden, versuchen Sie "pip install watchfiles"

source: Hot reload is working!
de: Hot Reload funktioniert!

source: Reload config file "{self._config_file}"
de: Konfigurationsdatei "{self._config_file}" neu laden

source: Hot reload: Added file: {file}
de: Hot Reload: Datei hinzugefügt: {file}

source: Hot reload: Deleted file: {file}
de: Hot Reload: Datei gelöscht: {file}

source: Hot reload: Modified file: {file}
de: Hot Reload: Datei geändert: {file}

source: Read config file failed:
de: Konfigurationsdatei Lesensfehle:

source: Unable to determine config file type
de: Konfigurationstyp der Datei konnte nicht bestimmt werden

source: Can not open config file: {e}
de: Kann Konfigurationsdatei nicht öffnen: {e}

source: Read config file failed: {e}
de: Konfigurationsdatei konnte nicht gelesen werden: {e}

source: Config dict parse error: {e}
de: Fehler beim Parsen des Konfigurationsdicts: {e}

source: Stopping iamai...
de: iamai wird gestoppt...

source: Force Exit iamai...
de: iamai wird erzwungen beendet...

source: Adapter {current_event.adapter.name} received: {current_event!r}
de: Adapter {current_event.adapter.name} empfangen: {current_event!r}

source: Checking for matching plugins with priority {plugin_priority!r}
de: Prüfen auf passende Plugins mit Priorität {plugin_priority!r}

source: Event will be handled by {_plugin!r}
de: Ereignis wird von {_plugin!r} bearbeitet

source: Exception in plugin {plugin!r}
de: Ausnahme im Plugin {plugin!r}

source: Event Finished
de: Ereignis abgeschlossen

source: Already have a same name plugin "{_plugin.__name__}"
de: Es gibt bereits ein Plugin mit demselben Namen "{_plugin.__name__}"

source: Succeeded to load plugin "{plugin_class.__name__}" from class "{plugin_class!r}"
de: Plugin "{plugin_class.__name__}" erfolgreich aus Klasse "{plugin_class!r}" geladen

source: Load plugin from class "{plugin_class!r}" failed:
de: Laden des Plugins aus Klasse "{plugin_class!r}" fehlgeschlagen:

source: Plugin priority incorrect in the class "{plugin_class!r}"
de: Plugin-Priorität in der Klasse "{plugin_class!r}" inkorrekt

source: Import module "{module_name}" failed:
de: Modul "{module_name}" konnte nicht importiert werden:

source: Loading plugins from module "{plugin_}"
de: Laden von Plugins aus Modul "{plugin_}"

source: Loading plugins from path "{plugin_}"
de: Laden von Plugins aus Pfad "{plugin_}"

source: The plugin path "{plugin_}" must be a file
de: Der Plugin-Pfad "{plugin_}" muss eine Datei sein

source: The path "{plugin_}" must endswith ".py"
de: Der Pfad "{plugin_}" muss mit ".py" enden

source: {plugin_} can not be loaded as plugin
de: {plugin_} kann nicht als Plugin geladen werden

source: Load plugin "{plugin_}" failed:
de: Laden des Plugins "{plugin_}" fehlgeschlagen:

source: Loading plugins from dirs {dir_list}
de: Laden von Plugins aus Verzeichnissen {dir_list}

source: Can not find Adapter class in the {adapter_} module
de: Adapterklasse im Modul {adapter_} nicht gefunden

source: More then one Adapter class in the {adapter_} module
de: Mehr als eine Adapterklasse im Modul {adapter_}

source: {adapter_} can not be loaded as adapter
de: {adapter_} kann nicht als Adapter geladen werden

source: Load adapter "{adapter_}" failed:
de: Laden des Adapters "{adapter_}" fehlgeschlagen:

source: Succeeded to load adapter "{adapter_object.__class__.__name__}" from "{adapter_}"
de: Adapter "{adapter_object.__class__.__name__}" erfolgreich aus "{adapter_}" geladen

source: Can not find adapter named "{adapter}"
de: Adapter mit dem Namen "{adapter}" nicht gefunden

source: Can not find plugin named "{name}"
de: Plugin mit dem Namen "{name}" nicht gefunden

source: Installing plugin: {plugin_name}
de: Plugin wird installiert: {plugin_name}

source: Current version: {version}
de: Aktuelle Version: {version}
